---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
source: html/1a868ca3-f8f9-4944-2c96-eea6957374fa.htm
---
# StructuralConnectionHandlerType Properties

The id of the assembly instance to which the element belongs.